In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import sklearn
import numpy as np

/home/ubuntu/anaconda3/lib/python3.6/site-packages/matplotlib/__init__.py:1067: UserWarning: Duplicate key in file "/home/ubuntu/.config/matplotlib/matplotlibrc", line #2
  (fname, cnt))
/home/ubuntu/anaconda3/lib/python3.6/site-packages/matplotlib/__init__.py:1067: UserWarning: Duplicate key in file "/home/ubuntu/.config/matplotlib/matplotlibrc", line #3
  (fname, cnt))

In [2]:
cluster_2016 = pd.read_csv('cluster_data1.csv')
population_16 = pd.read_csv('population_16.csv')

### Features use for the dataset

* VEHICLE_TYPE	
* START_RENTAL_ZONE	
* END_RENTAL_ZONE	
* CITY_RENTAL_ZONE
* TECHNICAL_INCOME_CHANNEL
* Ride_Duration
* Month

#### All categorical variables are converted to integer value by either encoding or with their ids

In [3]:
cluster_2016.head(5)

,VEHICLE_HAL_ID,START_RENTAL_ZONE,START_RENTAL_ZONE_HAL_ID,END_RENTAL_ZONE,END_RENTAL_ZONE_HAL_ID,CITY_RENTAL_ZONE,TECHNICAL_INCOME_CHANNEL,Ride_Duration_new,Month
0,108647,Überseering/Mexikoring,213687.0,Bebelallee/Meenkwiese,213855.0,Hamburg,Android,28.800000,1
1,108371,Stadthausbrücke / Neuer Wall,138379.0,Goldbekplatz / Semperstraße,140796.0,Hamburg,iPhone,27.050000,1
2,119829,Jungfernstieg / Ballindamm,131879.0,Hauptbahnhof Ost / Hachmannplatz,131873.0,Hamburg,iPhone,11.216667,1
3,116810,Hudtwalckerstraße / Bebelallee,138378.0,Kellinghusenstraße / Loogeplatz,140795.0,Hamburg,others,75.383333,1
4,120345,Bahnhof Dammtor Nord // Theodor-Heuss-Platz,131883.0,Feldstraße / Marktstraße,244093.0,Hamburg,Android,8.983333,1

In [4]:
#df_city = pd.get_dummies(cluster_2016['CITY_RENTAL_ZONE'])

In [5]:
#cluster_2016["CITY_RENTAL_ZONE"] = cluster_2016["CITY_RENTAL_ZONE"].astype('category')
#cluster_2016["TECHNICAL_INCOME_CHANNEL"] = cluster_2016["TECHNICAL_INCOME_CHANNEL"].cat.codes

#### Changing CITY_RENTAL_ZONE and TECHNICAL_INCOME_CHANNEL to category and then apply dummy encoding for converting them to integer value

In [6]:
cluster_2016['CITY_RENTAL_ZONE']=cluster_2016['CITY_RENTAL_ZONE'].astype('category').cat.codes
cluster_2016['TECHNICAL_INCOME_CHANNEL']=cluster_2016['TECHNICAL_INCOME_CHANNEL'].astype('category').cat.codes
cluster_2016 = cluster_2016.drop(columns=['START_RENTAL_ZONE', 'END_RENTAL_ZONE'])

In [7]:
cluster_2016.head()

,VEHICLE_HAL_ID,START_RENTAL_ZONE_HAL_ID,END_RENTAL_ZONE_HAL_ID,CITY_RENTAL_ZONE,TECHNICAL_INCOME_CHANNEL,Ride_Duration_new,Month
0,108647,213687.0,213855.0,18,0,28.800000,1
1,108371,138379.0,140796.0,18,4,27.050000,1
2,119829,131879.0,131873.0,18,4,11.216667,1
3,116810,138378.0,140795.0,18,5,75.383333,1
4,120345,131883.0,244093.0,18,0,8.983333,1

In [ ]:
#x = cluster_2016.reset_index().values

* Here we apply **K-modes** algorithm as this dataset have both categorical value and numerical values.

In [8]:
! pip install kmodes

Requirement already satisfied: kmodes in /home/ubuntu/anaconda3/lib/python3.6/site-packages
Requirement already satisfied: scipy>=0.13.3 in /home/ubuntu/anaconda3/lib/python3.6/site-packages (from kmodes)
Requirement already satisfied: scikit-learn<0.20.0,>=0.19.0 in /home/ubuntu/anaconda3/lib/python3.6/site-packages (from kmodes)
Requirement already satisfied: numpy>=1.10.4 in /home/ubuntu/anaconda3/lib/python3.6/site-packages (from kmodes)

In [ ]:
import numpy as np
from kmodes.kmodes import KModes

# making cluster size to 3 with 4 iteration 
km = KModes(n_clusters=3, init='Huang', n_init=4, verbose=1)

# Predict only for 2016 year dataset
clusters = km.fit_predict(cluster_2016)

cluster_2016['clusters'] = clusters

# Print the cluster centroids
print(km.cluster_centroids_)

#### For Visuaisation we apply PCA to decomposes all the features to two features and representing it in X and Y axis.

In [ ]:
from sklearn.decomposition import PCA
pca = PCA(2)
# Turn the dummified df into two columns with PCA
plot_columns = pca.fit_transform(cluster_2016.loc[:,:])
plot_columns.shape

In [ ]:
# Plot based on the two dimensions, and shade by cluster label
# s = marker size


colors = ['red','green','blue']

plt.scatter(x=plot_columns[:,1],y=plot_columns[:,0], color=[colors[l_] for l_ in cluster_2016["clusters"]], label=cluster_2016["clusters"])
#plt.scatter(centroids[:, 0],centroids[:, 1], color=[c for c in colors[:len(centroids)]], marker = "x", s=150, linewidths = 5, zorder = 10)

#plt.scatter(x=plot_columns[:,1], y=plot_columns[:,0], c=cluster_2016["clusters"], s=30)
plt.show()

## applying different visualisation between different features with clusters

In [ ]:
# Plot based on the two dimensions, and shade by cluster label
# s

plt.scatter(x=cluster_2016.as_matrix()[:,5], y=cluster_2016.as_matrix()[:,1], c=cluster_2016["clusters"], s=30)
plt.show()

In [ ]:
cluster_2016.as_matrix()[:,0]

In [10]:
cluster_2016.head()

,VEHICLE_HAL_ID,START_RENTAL_ZONE_HAL_ID,END_RENTAL_ZONE_HAL_ID,CITY_RENTAL_ZONE,TECHNICAL_INCOME_CHANNEL,Ride_Duration_new,Month
0,108647,213687.0,213855.0,18,0,28.800000,1
1,108371,138379.0,140796.0,18,4,27.050000,1
2,119829,131879.0,131873.0,18,4,11.216667,1
3,116810,138378.0,140795.0,18,5,75.383333,1
4,120345,131883.0,244093.0,18,0,8.983333,1

In [ ]:
import seaborn as sns
sns.pairplot(cluster_2016)
plt.show()

### Result of the the dataset with cluster label.

In [ ]:
cluster_2016.head(100)

### Cluster-0 labeled dataset

In [ ]:
cluster_2016[cluster_2016['clusters'] == 0].head(100)

### Cluster-1 labeled dataset

In [ ]:
cluster_2016[cluster_2016['clusters'] == 1].head(100)

### Cluster-2 labeled dataset

In [ ]:
clu`ster_2016[cluster_2016['clusters'] == 2].head(100)

### Cluster-3 labeled dataset

In [ ]:
cluster_2016[cluster_2016['clusters'] == 3].head(100)

## Adding New Population Features

### concatinating population dataset with 2016 bike share dataset

In [ ]:
area_dict = dict(zip(population_16.CITY_RENTAL_ZONE, population_16.Population16))

In [ ]:
new_cluster_2016 = pd.read_csv('cluster_data1.csv')
new_cluster_2016.head()

In [ ]:
new_cluster_2016['population'] = new_cluster_2016['CITY_RENTAL_ZONE']
new_cluster_2016.head()

In [ ]:
new_cluster_2016 = new_cluster_2016.replace({"population": area_dict})

In [ ]:
# New Population features which can directly feed into clustering model

new_cluster_2016.head()

#### Some cities poplation are missing

In [ ]:
new_cluster_2016['population'].unique()

In [ ]:
#final = pd.concat([cluster_2016,population_16],axis=1, copy=False)
#result = pd.concat([df1, df4], axis=1, join_axes=[df1.index])
#final.head()
#final = final.dropna(axis=0, how='any')